# ----------------------------------------------------------------------
# Terminals

# tmux
brew 'tmux'


# ----------------------------------------------------------------------
# Shells

# bash
brew 'bash'

# bash-completion
brew 'bash-completion'

# zsh
brew 'zsh'


# ----------------------------------------------------------------------
# Editors

# vim editor
brew 'vim', args: ['with-lua']

# nano editor
brew 'nano'


# ----------------------------------------------------------------------
# Downloaders

# curl
brew 'curl'

# wget
brew 'wget'


# ----------------------------------------------------------------------
# Version control

# git
brew 'git'

# mercurial
brew 'hg'

# subversion
brew 'subversion'


# ----------------------------------------------------------------------
# GNU command line tools

# coreutils
brew 'coreutils'

# binutils
brew 'binutils'

# diffutils
brew 'diffutils'

# ed
brew 'ed', args: ['with-default-names']

# findutils
brew 'findutils'

# gawk
brew 'gawk'

# gnu-indent
brew 'gnu-indent', args: ['with-default-names']

# gnu-sed
brew 'gnu-sed', args: ['with-default-names']

# gnu-tar
brew 'gnu-tar', args: ['with-default-names']

# gnu-which
brew 'gnu-which', args: ['with-default-names']

# gnutls
brew 'gnutls'

# grep
brew 'grep', args: ['with-default-names']

# gzip
brew 'gzip'

# screen
brew 'screen'

# watch
brew 'watch'

# wdiff
brew 'wdiff', args: ['with-gettext']

###
## Some GNU command line tools already exist by default on macOS
## We choose to replace these with newer versions.
###

# gdb
brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.

# gpatch
brew 'gpatch'

# less
brew 'less'

# m4
brew 'm4'

# make
brew 'make'


# ----------------------------------------------------------------------
# System related

# automake
brew 'automake'


# ----------------------------------------------------------------------
# File compression/uncompression

# zstandard
brew 'zstd'

# winrar
brew 'unrar'


# ----------------------------------------------------------------------
# Misc

# tree
brew 'tree'
